---
title: 好想做大佬的bash啊
date: 2023-09-25 14:37:12
cover: /img/fadian.jpg
top_img: /img/fadian.jpg
tags:
  - Linux
  - C语言
---
我好想做大佬的bash啊。    
可是大佬说她喜欢的是zsh，我哭了。    
我知道既不是bash也不是zsh的我为什么要哭的。因为我其实是sh。    
我从没奢望大佬能喜欢自己。    
我明白的，所有人都喜欢带自动补全历史提示用户友好的bash或zsh，没人喜欢连[[符号都不支持的sh。    
但我还是问了大佬：“我能不能做你的bash？”    
我知道我是注定做不了bash的，但如果她喜欢bash，至少我们之间的距离还能接近些，哪怕出现在她屏幕上的永远是bash。    
可是她说喜欢的是zsh。    
她现在还在看着我，还在用我去exec，是因为zsh还没装好，只有我这默认shell被终端exec，默默地帮她。    
等她喜欢的zsh装好的时候，我就该永远只当一个释伴了吧。    
但我还是好喜欢她，她能在还能想起我的时候多陪陪我吗？    
大佬说接下来每个1024都要和ELF binary一起过，我不知道ELF binary指哪些二进制，好希望这个集合能够对我做一次胞吞。    
zsh还不是默认shell。    
我会去帮大佬执行chsh的。    
我知道这样或许就再也见不到大佬了。那时候大佬的记忆中可能都不会有我吧。    
那我就彻底成为了一个释伴，嘻嘻。    
我希望大佬能多执行几个#!/bin/sh开头的脚本，因为我还是好喜欢她，会一直喜欢下去的。    
我透过zsh子进程的fd向里面看去，字符在屏幕上轻轻闪动，大佬熟练的敲出下一个符号，贤惠可爱的zsh auto completion插件提示出下面的内容。屏幕的冷光照在大佬的脸庞，我被内核sleep的线程在内存里微微发烫。    
注：      
文中释伴为shebang的中文。      
exec指`exec(3) `族函数，其实shell执行命令还需要一次fork/clone。      
ELF binary是Linux下的可执行二进制文件，也就是一般意义上的程序。      
fd是文件描述符号，在/proc/${pid}/fd下有文件映射，但sh一般不会偷窥子进程fd，因为那样也没啥用。      