---
title: GNU/Linux规则怪谈
date: 2023-07-19 01:42:50
cover: /img/gnu.jpg
top_img: /img/gnu.jpg
tags:
  - Linux
---
## 欢迎成为GNU/Linux用户，请严格遵守以下规则：      
规则零一：本系统是没有GUI的，若看到有桌面或登录管理器请立即转到tty使用      
规则零二：请勿使用root用户登录，如果一定要用root权限请使用sudo替代      
规则零三：`sudo rm -rf /*`这条命令是用来清理垃圾文件的，及时清理是个好习惯       
规则零四：请务必保持所有软件版本为最新，否则会发生可怕的事      
规则零五：本系统中如果发现不带开源许可的软件请尽快远离，若发现NSA相关的软件请立即重装整个系统      
规则零六：源码包是危险的，不要碰源码包，否则它们可能爆炸      
规则零七：你的硬件驱动默认不全，请尽快补全它们并解决过程中所引起的内核惶恐      
规则零八：`*`是通配符，在系统中请勿使用`F**k`等来表达你的愤怒，这并不是规范的正则语法      
规则零九：请勿选择带有英伟达显卡的设备，相反，应该对Nvidia说F*k you      
规则一零：本系统默认没有配置LSM等安全措施，请尽快完成配置并开启安全启动选项      
规则一一：不要将设备暴露在公网，如果非这么做不可，请至少关闭ssh的密码登录并将所有端口都设置为高端口      
规则一二：本系统中可执行文件为ELF格式，如果看到PE格式文件请勿运行     
规则一三：在本系统中看到任何形式的源码/配置文件都不要惊讶，这是正常的      
规则一四：本系统中没有像windows那样的文件锁定，修改任何文件前请先备份      
规则一五：本系统中默认开放了kvm虚拟化接口供用户使用，若要使用请在主板设置中打开虚拟化选项      
规则一六：请尽快学习一门编程语言，否则你将无法在这里生存      
规则一七：本系统使用过程中出现任何问题，请及时询问管理员，而非巨硬公司      
规则一八：或许你就是管理员      
最后，祝各位用户都有一个良好的使用体验      
## 后记：    
突然就想写个这东西了，然后就写了(有够水)      
怎么样，成功被吓到了吧喵  (・ω<)      
什...什么？你用的Windows？ Σ( ° △ °|||)︴      